# ── Tap ───────────────────────────────────────────────────────────────────────
tap "code-hex/tap", trusted: true      # required for neo-cowsay
tap "vasylromanets/tap", trusted: true # required for spinpacks

# ── Brew: Essential ───────────────────────────────────────────────────────────
brew "bat"                          # syntax-highlighted file viewer (better cat)
brew "eza"                          # file listing (better ls)
brew "fd"                           # find files (better find)
brew "fzf"                          # fuzzy finder for files, history, and more
brew "gh"                           # official GitHub CLI
brew "git"                          # version control
brew "git-delta"                    # syntax-highlighted diffs (better diff-so-fancy)
brew "git-filter-repo"              # rewrite git history (better bfg)
brew "git-lfs"                      # git large file storage extension
brew "jq"                           # JSON processor
brew "mas"                          # CLI for the Mac App Store
brew "micro"                        # terminal-based text editor (better nano)
brew "ripgrep"                      # searching within files (better grep)
brew "starship"                     # cross-shell prompt manager
brew "stow"                         # symlink farm manager
brew "toml2json"                    # TOML to JSON convertor
brew "yq"                           # YAML processor (like jq for YAML)
brew "zoxide"                       # auto-learning navigation (better cd)
brew "zsh"                          # the Z shell itself
brew "zsh-autosuggestions"          # fish-like command suggestions from history
brew "zsh-history-substring-search" # arrow-key history search by substring
brew "zsh-syntax-highlighting"      # highlight commands as you type

# ── Brew: Useful ──────────────────────────────────────────────────────────────
brew "asciinema"     # record and share terminal sessions
brew "btop"          # resource and process monitor (better htop)
brew "croc"          # encrypted peer-to-peer file transfer
brew "duf"           # mounted disk usage overview (better df)
brew "fastfetch"     # system info display (better neofetch)
brew "grex"          # generate regex from provided examples
brew "jrnl"          # command-line journal
brew "shellcheck"    # static analysis tool for shell scripts
brew "taplo"         # TOML toolkit
brew "tealdeer"      # simplified man pages (tldr command)
brew "tokei"         # count lines of code by language (better cloc)
brew "trash-cli"     # move files to trash instead of permanently deleting (safer rm)
brew "watch"         # run commands periodically
brew "wifi-password" # show the password for the connected Wi-Fi network

# ── Brew: Fun ─────────────────────────────────────────────────────────────────
brew "asciiquarium" # aquarium animation
brew "cbonsai"      # grow a bonsai tree
brew "cmatrix"      # matrix rain animation
brew "figlet"       # print large ASCII text banners
brew "fortune"      # print a random adage or joke
brew "lolcat"       # rainbow-colorize any command output
brew "neo-cowsay"   # cowsay with many more animals
brew "pipes-sh"     # animated pipes terminal screensaver
brew "sl"           # steam locomotive (penalty for typing sl instead of ls)
brew "spinpacks"    # themed spinner verb packs for Claude Code

# ── Cask: Fonts ───────────────────────────────────────────────────────────────
cask "font-meslo-lg-nerd-font" # my main terminal & editor font (MesloLGS NF)

# ── Cask ──────────────────────────────────────────────────────────────────────
cask "blackhole-2ch"          # virtual audio driver for routing audio between apps
cask "claude-code"            # AI coding assistant
cask "cleanmymac"             # system cleaner and optimizer
cask "discord"                # voice, video, and text chat
cask "fork"                   # git GUI client
cask "ghostty"                # terminal emulator
cask "git-credential-manager" # cross-platform git credential storage
cask "google-chrome"          # web browser
cask "hammerspoon"            # lua-driven macOS automation and scripting
cask "handbrake"              # video transcoder
cask "iina"                   # media player
cask "keka"                   # file archiver
cask "mediamate"              # now-playing overlay for Spotify and media controls
cask "obsidian"               # markdown-based personal knowledge base
cask "raycast"                # app launcher (better Spotlight)
cask "reflex-app"             # media key forwarder for Spotify
cask "shottr"                 # screenshot tool
cask "signal"                 # encrypted, privacy-focused messaging
cask "spotify"                # music
cask "transmission"           # BitTorrent client
cask "unity-hub"              # launcher for Unity editor
cask "visual-studio-code"     # code editor
cask "zed"                    # fast code editor
cask "zoom"                   # video conferencing

# ── App Store ─────────────────────────────────────────────────────────────────
mas "Bitwarden", id: 1352778147     # password manager
mas "ClearVPN", id: 1531601984      # VPN client
mas "CotEditor", id: 1024640650     # plain-text and code editor
mas "Hidden Bar", id: 1452453066    # hide clutter from the menu bar
mas "Spark Desktop", id: 6445813049 # email client
mas "Today", id: 6443714928         # today’s schedule in the menu bar
mas "Todoist", id: 585829637        # to-do list
mas "WhatsApp", id: 310633997       # messaging

# ── VS Code ───────────────────────────────────────────────────────────────────
vscode "catppuccin.catppuccin-vsc"            # catppuccin pastel color theme
vscode "catppuccin.catppuccin-vsc-icons"      # catppuccin file icon theme
vscode "editorconfig.editorconfig"            # editorconfig support
vscode "esbenp.prettier-vscode"               # prettier code formatter
vscode "foxundermoon.shell-format"            # shell script formatter
vscode "mads-hartmann.bash-ide-vscode"        # bash language server integration
vscode "mechatroner.rainbow-csv"              # syntax highlighting and editing for CSV/TSV
vscode "ms-dotnettools.csdevkit"              # dev kit for C# and .NET
vscode "ms-dotnettools.csharp"                # language support for C#
vscode "ms-dotnettools.vscode-dotnet-runtime" # .NET runtime
vscode "ms-vscode.mono-debug"                 # Mono debugger support
vscode "neikeq.godot-csharp-vscode"           # Godot engine and C# support
vscode "oderwat.indent-rainbow"               # colorize indentation levels
vscode "visualstudiotoolsforunity.vstuc"      # Unity integration
vscode "zhuangtongfa.material-theme"          # material color theme (One Dark Pro)
