tap "code-hex/tap"

brew "asciiquarium"
brew "bat"
brew "c2048"
brew "cmatrix"
brew "eza"
brew "fastfetch"
brew "fortune"
brew "git"
brew "git-filter-repo"
brew "htop"
brew "lolcat"
brew "mas"
brew "micro"
brew "powerlevel10k"
brew "ripgrep"
brew "sl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "code-hex/tap/neo-cowsay"

cask "cleanmymac"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "fork"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "keka"
cask "mediamate"
cask "obsidian"
cask "raycast"
cask "reflex-app"
cask "signal"
cask "spotify"
cask "visual-studio-code"
cask "zed"

mas "Bitwarden", id: 1352778147
mas "ClearVPN", id: 1531601984
mas "CotEditor", id: 1024640650
mas "Hidden Bar", id: 1452453066
mas "Spark Desktop", id: 6445813049
mas "Todoist", id: 585829637
mas "WhatsApp", id: 310633997

vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode.mono-debug"
vscode "neikeq.godot-csharp-vscode"
vscode "oderwat.indent-rainbow"
vscode "visualstudiotoolsforunity.vstuc"
vscode "zhuangtongfa.material-theme"
